{
  "basics": 
  {
    "name": "Aubrie Usui",
    "label": "Student",
    "picture": "https://auusui.github.io/images/profile.png",
    "email": "usui.aubrie@gmail.com",
    "phone": "808-469-8486",
    "website": "https://auusui.github.io",
    "summary": "I am studying for a B.S. in Computer Science in the Department of Information and Computer Sciences at the University of Hawaii. I expect to graduate in Spring, 2021.  My desired field/career I want to work towards is Hawaiian Airlines IT department.",
    "location": {
      "address": "",
      "postalCode": "96821",
      "city": "Honolulu",
      "countryCode": "USA",
      "region": "Hawaii"
    },
    
    "profiles": [
      {
        "network": "github",
        "username": "auusui",
        "url": "auusui.github.io/"
      },
      {
        "network": "linkedin",
        "username": "Aubrie Usui",
        "url": "https://www.linkedin.com/in/aubrie-usui-80b669139/"
      }
    ]
  },
  "interests": [
    {
      "name": "AI Imaging",
      "keywords": [
        
      ]
    },
    {
      "name": "Software Development",
      "keywords": [
      ]
    },
    {
      "name": "Hospital Software Researcher",
      "keywords": [
      ]
    }
  ],
  
  "skills": [
    {
      "name": "Web Tools",
      "level": "Moderate",
       "keywords": [
        "C",
        "C++",
        "Java",
        "Javascript",
        "Microsoft Word",
        "Microsoft Excel",
        "Semantic UI/React",
        "Python",
        "SQL",
        "HTML/CSS",
        "Linux",
        "Exclipse/IntelliJ",
        "X-ray",
        "Pupeteer",
        "Figma - Framework"
      ]
    },
    {
      "name": "Others",
      "level": "",
      "keywords": [
        "Mathematics", 
        "Customer Service", 
        "Tutoring", 
        "Time Management",
        "Multi-tasking", 
        "Independent Worker", 
        "Deadline Driven",
        "Functional Programming"
      ]
    }
  ],
  
  "education": [
    {
      "institution": "University of Hawaii, Honolulu, HI",
      "area": "Computer Science (expected Spring, 2021)",
      "studyType": "B.S.",
      "startDate": "2018-09-21",
      "endDate": "Present",
      "project" : "Link Up Manoa Project: Created a web application with a few classmates with the purpose of making it easier to create study groups with people in similar classes or majors.  I developed the friends page as well as half of the reminders page.  I was in charge of the front and back-end engineering of the two pages. I used mostly Semantic UI React with some CSS and HTML.",
      "gpa": "3.0",
      "courses": [
        "Intro to Computer Science I & II",
        "Discrete Mathematics I & II",
        "Calculus I & II", 
        "Linear Alg. & Differential Equations",
        "Program Structure(C/C++/Scripting)",
        "Algorithms",
        "Software Engineering I",
        "Data Science Fundamentals",
        "Database Systems I"
      ]
    }
  ],
  
  "work": [
    {
      "company": "RadGrad2 - InternBit",
      "position": "Intern",
      "startDate": "May 2020",
      "endDate": "August 2020",
      "summary": "Worked with team to improve and create a web application called InternBit.  Helped create design mockups of the pages we would implement into the application as well as code the front and back-end of the app.  Also dealt with javascript libraries using scrapers to collect public information off of websites.  The goal of the app is to create an easier way for students to find an internship without looking on a million websites.",
    },
    {
      "company": "Lululemon Athletica",
      "position": "Educator",
      "website": "",
      "startDate": "November 2020",
      "endDate": "present",
      "summary": "Lululemon is a well-known Canadian-based company that sells everything relating to athletics.  I work for this company because of its purpose and its people.  For the short time I have been here, I have already fallen in love with the dynamic of my team and what this company stands for.  It is a balance of fun and work, but always getting the job done in the best way possible.  As an educator, I “educate” customers about our products and help them find the best attire for their athletic needs.  I also work inventory shifts where we unload all the shipments, fold/hang all the products correctly, and store them in the backroom neatly organized.  In my day shifts, I work restock as well, which is where I pull products from the back room and put them out front in the store so all sizes/styles are present.  Regardless of the position I work, I will always have customer service available if someone stops me to get help.",
      "highlights": [
      ]
    },
    {
      "company": "Kapahulu Express Laundromat",
      "position": "Assistant Manager",
      "website": "",
      "startDate": "July 2013",
      "endDate": "present",
      "summary": "Advised and assisted customers in using the complex, coinless card system. Offered hands-on assistance to customers, assessing needs and maintaining current knowledge of consumer preferences. Provided exceptional customer service and responded to customer concerns in a friendly and knowledgeable manner",
      "highlights": [
      ]
    },
    {
      "company": "Iolani High School",
      "position": "Assistant Track and Field Coach",
      "startDate": "January 2019",
      "endDate": "May 2020",
      "summary": "Worked with athletes to improve coordination through strategic drills and confidence.  Collaborated with Head Coach on the most effective workouts, player discipline, and performance analysis. Developed a relationship with each and every athlete on the team, helping each to succeed based on their individual strengths and weaknesses",
    },
    {
      "company": "Bloomingdale's Forty Carrots",
      "position": "Hostess/Barista",
      "startDate": "June 2018",
      "endDate": "August 2018",
      "summary": "Answered phone calls, accommodate customers’ special needs, and ensured that service was quick and efficient.  Prepared beverages and desserts based on customers’ preference.  Closed and opened restaurant according to restaurant procedures and policies, took inventory of supplies and money in registers.  I learned to team building skills as I picked up some slack from coworkers if they were slammed with orders and helped grab shipments or extra supplies when we needed them.",
    }
  ],
  
  "volunteer": [
    {
      "organization": "Kāneʻwai Loʻi",
      "website": "",
      "position": "Helper",
      "startDate": "August 2019",
      "endDate": "Present",
      "summary": "The Loʻi is a Hawaiian term meaning taro patches.  Taro is a type of plant that is very common for Hawaiians to grow and was one of the main foods they ate.  I volunteer here on every first Saturday of the month to help with whatever the leaders tell me to do.  My duties would include stomping in the mud to bury the leaves, re-mmounding the mud piles around the kalo plants, or collecting leaves to put into the patches.  It is very humbling and teaches me team work as well as patience.",
      "highlights": [
  
       ]
    },
    {
      "organization": "Information Technology Management Association Club",
      "website": "",
      "position": "Club Member",
      "startDate": "January 2020",
      "endDate": "May 2020",
      "summary": "ITMA is a student organization at UH Manoa focused on information technology and business combined.  My position is under the Director of Marketing and I help him create flyers for the club to post on social medias and t-shirt designs.",
      "highlights": [
       ]
    },
    {
      "organization": "Wellness Warrior Club",
      "website": "",
      "position": "Club Member",
      "startDate": "August 2020",
      "endDate": "current",
      "summary": "A new UH Manoa club based on the Blue Zones Project Organization.  The Blue Zones project aims to apply lifestyle principles, research, and learning from making healthy choices easier and helping people live longer, healthier, and happier lives to transform our lives.  I joined this club because being an athlete (especially a track athlete) makes me more aware of what I put into my body and how I take care of it as well.  We do this by following the “Power 9” principles.  The one that I have been focusing on more is the principle of down shift, which means allow yourself to relax from time to time and leave room to give yourself a break from all the hard work you do.  ",
      "highlights": [
       ]
    }
  ],
  "awards": [
    {
      "title": "Division 1 Athletic Scholarship",
      "date": "2019-Present",
      "awarder": "University of Hawaii at Manoa",
      "summary": "Scholarships awarded to athletes who perform well and scores points at the conference as well as hold a good GPA."
    },
    {
      "title": "Big West Honor Roll",
      "date": "Spring 2018",
      "awarder": "Big West Conference",
      "summary": "Earning a cummulative GPA over 3.0."
    },
    {
      "title": "Most Improved Player",
      "date": "Spring 2020",
      "awarder": "UH Track and Field",
      "summary": "Awarded to the player that resembled the most improvement in her events as well as having a warrior attitude."
    },
    {
      "title": "Big West Honor Roll",
      "date": "Fall 2020",
      "awarder": "Big West Conference",
      "summary": "Earning a cummulative GPA over 3.0."
    }
  ],
  "references": [
    {
      "name": "Available upon request",
      "reference": ""
    }
  ]
}
}
